"""

1.SyntaxError:语法错误，通常是由于代码书写不正确而引发的异常。

2.NameError:名称错误，当尝试访问一个未定义的变量或名称时引发的异常。

3.IndexError:索引错误，当访问列表、元组或字符串等序列类型时使用了无效的索引引发的异常。

4.KeyError:键错误，当尝试使用字典中不存在的键引发的异常。

5.ValueError:值错误，当函数接收到一个正确类型但是不合法的值时引发的异常。

6.FileNotFoundError:文件未找到错误，当尝试打开或操作不存在的文件时引发的异常。

7.ImportError:导入错误，当导入模块失败时引发的异常，可能是因为找不到模块或模块中缺少所需的内容。

8.ZeroDivisionError:零除错误，当除法或取模运算的除数为零时引发的异常。

9.AttributeError:属性错误，当尝试访问对象不存在的属性或方法时引发的异常。

10.I0Error:输入/输出错误，当发生与输入和输出操作相关的错误时引发的异常。
        例如，尝试读取不存在的文件或在写入文件时磁盘已满。

"""

